# Model Cars Company

# Index

- [1 Introduction](#1)
- [2 Reading the Data](#2)
- [3 And Your Question is..?](#3)
- [4 Supply and Profit](#4)
- [5 Customer Loyalty](#5)
- [6 Show Me the Money... By Country!!](#6)
- [7 Most Sought After..](#7)
- [8 Monthly Profits Performance...](#8)
- [9 Closing the Deal..](#9)
- [10 Put that Money to Work..](#10)
- [11 Deadstock](#11)
- [12 Recommendations](#12)
- [13 Conclusions](#13)
- [14 Learnings](#14)

# 1

## Introduction

![image.png](attachment:image.png)
*Source*:[mycustomhotwheels](https://mycustomhotwheels.com/hotwheels-at-hin2018/)

Vehicle Models Company is a fictitious wholesale distributor of die cast models of vehicles ranging from vintage cars to planes. They have customers in more than 15 countries around the world. 

The company has asked us to go over their dataset and analyse the same to make some essential decisions related to potential future expansion.

The goal of this project is to go over the questions that they have and extract answers based on the data.

# 2

## Reading the Data

The required data is available [here](https://www.mysqltutorial.org/mysql-sample-database.aspx) along with the schema which has been provided below.

In [1]:
%%capture
%load_ext sql
%sql sqlite:///stores.db

![image.png](attachment:image.png)

Before we proceed with analysing the database, let's look at an overview of it.

In [2]:
%%sql
SELECT '' AS Table_Names,'' AS Number_of_Attributes,'' AS Number_of_Rows
UNION ALL
SELECT 'Customer',13,(SELECT COUNT(*)
                        FROM customers)
UNION ALL
SELECT 'Products',9,(SELECT COUNT(*)
                        FROM products)
UNION ALL
SELECT 'ProductLines',4,(SELECT COUNT(*)
                        FROM productlines)
UNION ALL
SELECT 'Orders',7,(SELECT COUNT(*)
                        FROM orders)
UNION ALL
SELECT 'OrderDetails',5,(SELECT COUNT(*)
                        FROM orderdetails)
UNION ALL
SELECT 'Payments',4,(SELECT COUNT(*)
                        FROM payments)
UNION ALL
SELECT 'Employees',8,(SELECT COUNT(*)
                        FROM employees)
UNION ALL
SELECT 'Offices',9,(SELECT COUNT(*)
                        FROM offices)

 * sqlite:///stores.db
Done.

[('', '', ''),
 ('Customer', 13, 122),
 ('Products', 9, 110),
 ('ProductLines', 4, 7),
 ('Orders', 7, 326),
 ('OrderDetails', 5, 2996),
 ('Payments', 4, 273),
 ('Employees', 8, 23),
 ('Offices', 9, 7)]

Also, let's look at a description of each table:

- Customers: stores customerâ€™s data.
- Products: stores a list of scale model cars.
- ProductLines: stores a list of product line categories.
- Orders: stores sales orders placed by customers.
- OrderDetails: stores sales order line items for each sales order.
- Payments: stores payments made by customers based on their accounts.
- Employees: stores all employee information as well as the organization structure such as who reports to whom.
- Offices: stores sales office data.

In [1]:
import sqlite3
import pandas as pd
import seaborn as sns
import matplotlib.pyplot as plt

conn = sqlite3.connect('stores.db')
df = pd.read_sql_query("""SELECT * 
                            FROM offices;""", conn) s
df

,officeCode,city,phone,addressLine1,addressLine2,state,country,postalCode,territory
0,1,San Francisco,+1 650 219 4782,100 Market Street,Suite 300,CA,USA,94080,NA
1,2,Boston,+1 215 837 0825,1550 Court Place,Suite 102,MA,USA,02107,NA
2,3,NYC,+1 212 555 3000,523 East 53rd Street,apt. 5A,NY,USA,10022,NA
3,4,Paris,+33 14 723 4404,43 Rue Jouffroy D'abbans,None,None,France,75017,EMEA
4,5,Tokyo,+81 33 224 5000,4-1 Kioicho,None,Chiyoda-Ku,Japan,102-8578,Japan
5,6,Sydney,+61 2 9264 2451,5-11 Wentworth Avenue,Floor #2,None,Australia,NSW 2010,APAC
6,7,London,+44 20 7877 2041,25 Old Broad Street,Level 7,None,UK,EC2N 1HN,EMEA